{
  "header": {
    "home": "Home",
    "trajectory": "Trajectory",
    "portfolio": "Portfolio",
    "blog": "Blog",
    "contact": "Contact"
  },
  "footer": {
    "copyright": "All rights reserved.",
    "contentLicencedUnder": "Unless otherwise stated, the content of this site is licensed under",
    "sourceCodeAvailableOn": "Source code for this site is available on",
    "andIsLicencedUnder": "and is licenced under",
    "eupl": "European Union Public Licence"
  },
  "contactPage": {
    "title": "Contact",
    "description": "The ways to contact me, either by email, phone or social networks.",
    "headline": "Get in touch with me!",
    "enableJs": "JavaScript must be enabled to view the email address and phone number. This is done to prevent scrapers and spam.",
    "intro": "The easiest way to contact me is through my email address: <a href=\"#\" id=\"email-addr\">Enable JS</a>. You can also use <a href=\"https://wa.me/message/W7T7L4EZAELQI1\">WhatsApp</a> with the phone number <a href=\"#\" id=\"phone-number\">Enable JS</a>.",
    "socialMedia": "You can also find me on some social networks:"
  },
  "homePage": {
    "title": "Home",
    "description": "Homepage of my website",
    "welcome": "Welcome to my website. My name is Ariel, and here you will find information about me and my projects.",
    "whoAmI": "Who am I?",
    "whoAmIDesc": "I am a web developer who likes to learn new things and share knowledge. I enjoy programming, web design, and creativity. I love creating new things and learning from others.",
    "moreAboutMe": "More about me",
    "whatIDo": "What do I do?",
    "whatIDoDesc": "I currently work as a software developer and Cloud administrator at a technology company. I develop web applications in PHP and deploy them in the cloud securely and efficiently.",
    "myPortfolio": "My portfolio",
    "latestBlogPosts": "Latest blog posts",
    "viewAllPosts": "View all posts"
  },
  "trajectoryPage": {
    "title": "Trajectory",
    "description": "My trajectory as a software developer, with information about my education, work experience and projects I have worked on.",
    "headline": "My trajectory as a developer",
    "intro": "I am a software developer living in Vigo, Spain. I love technology and I enjoy learning new things. I am professionally dedicated to software development in all its aspects: from architecture design, implementation and production deployment, to other aspects such as user experience, accessibility and security.",
    "techTitle": "Technologies I master",
    "techDescription1": "I mainly master the Microsoft ecosystem: .NET (C#), ASP.NET Core, SQL Server, Azure and Azure DevOps. I also have experience with other languages and technologies, such as PHP, Python and Java. Additionally, I have frontend knowledge with HTML5, CSS3, JavaScript and TypeScript.",
    "techDescription2": "I also have experience with DevOps tools such as Docker, Kubernetes, Terraform and GitHub Actions; as well as the Azure Cloud ecosystem.",
    "educationTitle": "Education and credentials",
    "efsetCert1": "Official EF SET C2 Proficient Certificate",
    "efsetCert2": ": certifies my C2 English level, the highest according to the Common European Framework of Reference for Languages.",
    "viewCertificate": "View certificate",
    "azureDeveloperCert1": "Microsoft Certified: Azure Developer Associate",
    "azureDeveloperCert2": ": certifies my knowledge in Azure application development.",
    "viewCredential": "View credential",
    "azureDevOpsCert1": "Microsoft Certified: Azure DevOps Engineer Expert",
    "azureDevOpsCert2": ": certifies my knowledge in implementing DevOps methodologies in Azure with Azure DevOps and GitHub.",
    "higherTechCert1": "Higher Technical Certificate in Multiplatform Application Development",
    "higherTechCert2": ": higher vocational training degree, obtained at",
    "higherTechCert3": "IES de Teis",
    "higherTechCert4": "in Vigo.",
    "experienceTitle": "Work experience",
    "estelaria1": "Estelaria Solutions (Q3 2023 - present)",
    "estelaria2": "Full-stack application development, mainly in PHP with Symfony, MongoDB and Vanilla JavaScript. In addition, I implemented a considerable number of improvements in usability, accessibility and performance.",
    "estelaria3": "I am also responsible for managing the infrastructure on AWS, and implementing collaboration tools such as Jira and GitHub.",
    "polygon1": "Internship at Polygon-E (Q2 2023)",
    "polygon2": "I did my professional training internship at Polygon-E, where I developed several internal management applications with ASP.NET Core and Blazor, deploying on on-premise environments with Windows Server, IIS and SQL Server.",
    "projectsTitle": "Projects",
    "projectsDescription": "You can find the (public) projects I have worked on in <a href=\"/portfolio\">my portfolio</a> and on my <a href=\"https://github.com/arielcostas\">GitHub profile</a>."
  },
  "portfolioPage": {
    "title": "Portfolio",
    "description": "A list of projects I have worked on in recent years, with the technologies used.",
    "headline": "My portfolio",
    "intro": "In this section, you will find a list of the projects I have worked on, both for third parties and my own. If you would like more information about any of them, please do not hesitate to <a href=\"/contact\">contact me</a>.",
    "freelanceTitle": "Projects for third parties (freelance)",
    "freelanceDesc": "I have developed projects for third parties by commission, the most notable being the following:",
    "orderExtractorTitle": "Online Order Purchase Extractor",
    "orderExtractorDesc": "Desktop application that extracts data about online orders from various platforms (such as WooCommerce, Amazon, and eBay). <a href=\"/portfolio/order-extractor\">More information</a>.",
    "touristInfoTitle": "Tourist Information Point on Mobile Devices",
    "touristInfoDesc": "Web application for tourist information, with QR codes, 360° content, and YouTube embedding. <a href=\"/portfolio/dynamic-tourist-info\">More information</a>.",
    "wpConsultingTitle": "WordPress Consulting",
    "wpConsultingDesc": "Maintenance, optimisation, and migration work for WordPress websites and WooCommerce online shops. <a href=\"/portfolio/wp-consulting\">More information</a>. <a href=\"/contact\">Contact</a>.",
    "ownProjectsTitle": "My own projects",
    "ownProjectsDesc": "Additionally, I have several personal projects that I have developed in my own time, some of which are active and open source.",
    "personalWebTitle": "Personal Website",
    "personalWebDesc": "Developed with Astro, a static site generator that lets you write content in Markdown and publish to the web with excellent performance. Deployed on Azure Static Web Apps.",
    "mientrenoTitle": "MiEntreno (end-of-course project)",
    "mientrenoDesc": "Web application for managing sports training, with a simple and easy-to-use interface. Developed with ASP.NET Core, Razor Pages, and SQL Server. <a href=\"/portfolio/mientreno\">More information</a>. <a href=\"https://github.com/arielcostas/mientreno\">Source code</a>.",
    "vigo360Title": "Vigo 360",
    "vigo360Desc": "Blog about Vigo and its surroundings, mainly focused on mobility and toponymy. Developed in Go, with a MySQL database and deployed on a VPS managed by myself. <a href=\"/portfolio/vigo-360\">More information</a>. <a href=\"https://github.com/arielcostas/vigo360\">Source code</a>. <a href=\"https://vigo360.es\">Website</a>."
  }
}
