{
  "header": {
    "home": "Inicio",
    "trajectory": "Trayectoria",
    "portfolio": "Portafolio",
    "blog": "Blog",
    "contact": "Contacto"
  },
  "footer": {
    "copyright": "Todos los derechos reservados.",
    "contentLicencedUnder": "Salvo que se indique lo contrario, el contenido de este sitio está bajo licencia",
    "sourceCodeAvailableOn": "El código fuente de este sitio está disponible en",
    "andIsLicencedUnder": "y se ofrece bajo licencia",
    "eupl": "Licencia Pública de la Unión Europea"
  },
  "contactPage": {
    "title": "Contacto",
    "description": "Las formas de ponerte en contacto conmigo, ya sea por correo electrónico, teléfono o redes sociales.",
    "headline": "¡Ponte en contacto conmigo!",
    "enableJs": "Es necesario activar JavaScript para ver la dirección de correo electrónico y el número de teléfono. Esto se hace para evitar scrapers y spam.",
    "intro": "La forma más sencilla de contactar conmigo es a través de mi dirección de correo electrónico: <a href=\"#\" id=\"email-addr\">Activa JS</a>. También puedes usar <a href=\"https://wa.me/message/W7T7L4EZAELQI1\">WhatsApp</a> con el número de teléfono <a href=\"#\" id=\"phone-number\">Activa JS</a>.",
    "socialMedia": "También puedes encontrarme en algunas redes sociales:"
  },
  "homePage": {
    "title": "Inicio",
    "description": "Página de inicio de mi web",
    "welcome": "Te doy la bienvenida a mi web. Me llamo Ariel, y aquí encontrarás información sobre mí y mis proyectos.",
    "whoAmI": "¿Quién soy?",
    "whoAmIDesc": "Soy un desarrollador web que le gusta aprender cosas nuevas y compartir su conocimiento. Me gusta la programación, el diseño web y la creatividad. Me encanta crear cosas nuevas y aprender de los demás.",
    "moreAboutMe": "Más información sobre mí",
    "whatIDo": "¿Qué hago?",
    "whatIDoDesc": "Actualmente trabajo como desarrollador de software y administrador Cloud en una empresa de tecnología. Me encargo de desarrollar aplicaciones web en PHP y desplegarlas en la nube de forma segura y eficiente.",
    "myPortfolio": "Mi portfolio",
    "latestBlogPosts": "Últimas entradas del blog",
    "viewAllPosts": "Ver todas las entradas"
  },
  "trajectoryPage": {
    "title": "Trayectoria",
    "description": "Mi trayectoria como desarrollador de software, con información sobre mi educación, experiencia laboral y proyectos en los que he trabajado.",
    "headline": "Mi trayectoria como desarrollador",
    "intro": "Soy un desarrollador de software que vive en Vigo, España. Me gusta mucho la tecnología, y me gusta aprender cosas nuevas. Me dedico profesionalmente al desarrollo de software en todos sus ámbitos: desde el diseño de la arquitectura, la implementación y el despliegue en producción, pasando por otros aspectos como la experiencia de usuario, la accesibilidad y la seguridad.",
    "techTitle": "Tecnologías que domino",
    "techDescription1": "Domino principalmente el ecosistema de Microsoft: .NET (C#), ASP.NET Core, SQL Server, Azure y Azure DevOps. También tengo experiencia con otros lenguajes y tecnologías, como PHP, Python y Java. Además, tengo conocimientos de frontend con HTML5, CSS3, JavaScript y TypeScript.",
    "techDescription2": "También tengo experiencia con herramientas de DevOps como Docker, Kubernetes, Terraform y GitHub Actions; así como el ecosistema Cloud de Azure.",
    "educationTitle": "Educación y credenciales",
    "efsetCert1": "Certificado oficial EF SET C2 Proficient",
    "efsetCert2": ": acredita mi nivel de inglés C2, el más alto según el Marco Común Europeo de Referencia para las Lenguas.",
    "viewCertificate": "Ver certificado",
    "azureDeveloperCert1": "Microsoft Certified: Azure Developer Associate",
    "azureDeveloperCert2": ": acredita mis conocimientos en el desarrollo de aplicaciones en Azure.",
    "viewCredential": "Ver credencial",
    "azureDevOpsCert1": "Microsoft Certified: Azure DevOps Engineer Expert",
    "azureDevOpsCert2": ": acredita mis conocimientos en la implementación de metodologías de DevOps en Azure con Azure DevOps y GitHub.",
    "higherTechCert1": "Técnico Superior en Desarrollo de Aplicaciones Multiplataforma",
    "higherTechCert2": ": título de formación profesional de grado superior, obtenido en el",
    "higherTechCert3": "IES de Teis",
    "higherTechCert4": "en Vigo.",
    "experienceTitle": "Experiencia laboral",
    "estelaria1": "Estelaria Solutions (Q3 2023 - actualidad)",
    "estelaria2": "Desarrollo de aplicaciones full-stack, principalmente en PHP con Symfony, MongoDB y JavaScript Vanilla. Además, implementé una cantidad considerable de mejoras en usabilidad, accesibilidad y rendimiento.",
    "estelaria3": "También me encargo de la gestión de la infraestructura en AWS, y de la implementación de herramientas de colaboración como Jira y GitHub.",
    "polygon1": "FCT en Polygon-E (Q2 2023)",
    "polygon2": "Realicé mis prácticas de formación profesional en la empresa Polygon-E, donde desarrollé varias aplicaciones de gestión interna con ASP.NET Core y Blazor, desplegando sobre entornos on-premise con Windows Server, IIS y SQL Server.",
    "projectsTitle": "Proyectos",
    "projectsDescription": "Puedes encontrar los proyectos (públicos) en los que he trabajado en <a href=\"/portfolio\">mi portfolio</a> y en mi <a href=\"https://github.com/arielcostas\">perfil de GitHub</a>."
  },
  "portfolioPage": {
    "title": "Portfolio",
    "description": "Un listado de los proyectos en los que he trabajado en los últimos años, con las tecnologías utilizadas.",
    "headline": "Mi portfolio",
    "intro": "En esta sección encontrarás una lista de los proyectos en los que he trabajado, tanto para terceros como propios. Si quieres más información sobre alguno de ellos, no dudes en <a href=\"/contact\">contactar conmigo</a>.",
    "freelanceTitle": "Proyectos para terceros (freelance)",
    "freelanceDesc": "He realizado desarrollos de proyectos para terceros por encargo, siendo los más destacados los siguientes:",
    "orderExtractorTitle": "Extractor de pedidos compra online",
    "orderExtractorDesc": "Aplicación de escritorio que extrae los datos sobre los pedidos on-line de diversas plataformas (como WooCommerce, Amazon y Ebay). <a href=\"/portfolio/order-extractor\">Más información</a>.",
    "touristInfoTitle": "Punto de información turística en móviles",
    "touristInfoDesc": "Aplicación web de información turística, con QR, contenido en 360º e incrustado de YouTube. <a href=\"/portfolio/dynamic-tourist-info\">Más información</a>.",
    "wpConsultingTitle": "Consultoría WordPress",
    "wpConsultingDesc": "Trabajos de mantenimiento, optimización y migración de sitios web WordPress y tiendas online WooCommerce. <a href=\"/portfolio/wp-consulting\">Más información</a>. <a href=\"/contact\">Contactar</a>.",
    "ownProjectsTitle": "Proyectos propios",
    "ownProjectsDesc": "Además, tengo varios proyectos propios que he desarrollado en mi tiempo, estando algunos de ellos en activo, y como código abierto.",
    "personalWebTitle": "Web personal",
    "personalWebDesc": "Desarrollado con Astro, un generador de sitios web estáticos que permite escribir contenido en Markdown y publicar en la web con un rendimiento excelente. Desplegado sobre Azure Static Web Apps.",
    "mientrenoTitle": "MiEntreno (proyecto fin de ciclo)",
    "mientrenoDesc": "Aplicación web para la gestión de entrenamientos deportivos, con una interfaz sencilla y fácil de usar. Desarrollado con ASP.NET Core, Razor Pages y SQL Server. <a href=\"/portfolio/mientreno\">Más información</a>. <a href=\"https://github.com/arielcostas/mientreno\">Código fuente</a>.",
    "vigo360Title": "Vigo 360",
    "vigo360Desc": "Blog sobre Vigo y su entorno, orientado principalmente a hablar de movilidad y toponimia. Desarrollado en Go, con base de datos MySQL y desplegado sobre VPS administrado por mí mismo. <a href=\"/portfolio/vigo-360\">Más información</a>. <a href=\"https://github.com/arielcostas/vigo360\">Código fuente</a>. <a href=\"https://vigo360.es\">Web</a>."
  }
}
